docs/addiction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-20 Sat 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Diego Rodriguez" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ec917c">1. Addiction</a></li>
<li><a href="#org5ac6628">2. References</a></li>
</ul>
</div>
</div>
<div id="outline-container-org6ec917c" class="outline-2">
<h2 id="org6ec917c"><span class="section-number-2">1</span> Addiction</h2>
<div class="outline-text-2" id="text-1">
<p>
Smart people make dumb decisions. All the time. One expects that the intelligent
ones would always&#x2014;or more often than not&#x2014;make, well, intelligent decisions.
Or at least, justified ones. Yet, I see smart people make dumb decisions all the
time. At least I make dumb decisions all the time<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. But, just like having
bad health makes us appreciate our wellness more, dumb decisions make us think
more deeply about life. And, to me, anything that makes me reflect on my actions
and on life itself can't be that bad. However, there is a subset of dumb
decisions that can take you to a very dark path. A path called addiction.
</p>

<p>
Smart is one trait out of many. Some people are smart, others are charismatic,
and others are athletic. And there are some who are lucky enough to be all of
them. But, there is something dangerous when one (only) looks into the positive
impressions of others. In fact, this tendency to let positive traits of entities
to blind us from the negative ones is so pervasive that it has a name: the halo
effect. The halo effect affects us all. Because of it, we often forget that we
all have strength and weaknesses. Spanish people even have a proverb to remind
themselves about this:
</p>

<p>
<i>Ni el bueno es tan bueno, ni el malo es tan malo.</i>
</p>

<p>
Thus, you should try your best to not let the halo around smart people blind
you. It is a halo, not a shield. It does not protect them&#x2014;or anyone around
them&#x2014;from many of the problems many people have. And addiction is a hell of a
problem. Addiction is fake work and fake play. They let you engage in activities
and make you feel as if you are truly doing them; as if you are being mindful.
But that is only an illusion. When you go out and get drunk with strangers, you
are not fully socializing, you are tolerating other's people's existence with
the aid of a powerful&#x2014;yet legal&#x2014;drug. Before, looking for food was a synonym
for an anaerobic workout; now, it is more often than not the opposite. The era
of abundance that the modern world has brought to us has also brought a powerful
enemy for our society and its name is addiction.
</p>

<p>
If you focus your attention&#x2014;if there's any after you've depleted all of it in
a mixture of YouTube, Instagram, Reddit, and such&#x2014;you can see it everywhere.
People glued to their phones; not putting much effort into finding a partner by
going on online dates. Is a disciplined mind a free one? Based on my experience
of over-enjoying the abundance of modern world amenities, I think it is.
</p>
</div>
</div>

<div id="outline-container-org5ac6628" class="outline-2">
<h2 id="org5ac6628"><span class="section-number-2">2</span> References</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Naval on addiction -&gt; <a href="https://nav.al/addiction">https://nav.al/addiction</a></li>
<li>The World as 100 People over the last two centuries -&gt;
<a href="https://twitter.com/Altimor/status/1391546291851653121">https://twitter.com/Altimor/status/1391546291851653121</a>
<ul class="org-ul">
<li><p>
This chart gives us the perception that we are entering utopia. While this
might be true, and I hope so, it opens the gates of a new hell for humanity.
Abundance. Connotation is a function of time. Sometimes can be positive and
sometimes can be negative. "Abundance" is a word that has positive
connotations, but when I think about it today I cannot help but to think
about massive data, attention economy, digital addiction, or obesity.
</p>

<p>
The more problems you solve, the more problems you have to solve. But that
is how you solve really hard problems like math or world hunger.
</p></li>
</ul></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
It needs not be said, but&#x2026; the relationship between smart people and
drinking alcohol is a <a href="https://plato.stanford.edu/entries/conditionals/#TwoKinTruCon">pseudo material implication</a>. That is, smart people
(sometimes) drink alcohol. But, not all alcohol drinkers are smart. Society and
individuals would greatly benefit from understanding the difference between an
"if-then" statement and a "if-and-only-if" statement. Again, myself included.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Diego Rodriguez</p>
<p class="date">Created: 2021-11-20 Sat 23:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
